clear;clc;
x1=[-1 0 1 2];
y1=[-1 0 1 0];
dy0=0;dyn=-1;
pp = csape(x1,y1,'complete',[dy0,dyn]);
yi=ppval(pp,x1);
pp.coefs
plot(x1,y1,'o');
grid on;
hold on;
fnplt(pp);
hold on;
x=-1:0.01:2;
y=(-0.4667*(x+1).^3+1.4667*(x+1).^2-1).*(x>=-1&x<0)+...
    (-0.6*x.^3+0.0667*x.^2+1.5333*x).*(x>=0&x<1)...
    +(0.8667*(x-1).^3-1.7334*(x-1).^2-0.1333*x+1.1333).*(x>=1&x<2);

plot(x,y,'b','linewidth',1);
legend('原始数据点','内置函数结果','自编函数结果');
hold off;
% -0.6*(x-1).^3+0.0667*(x-1).^2+1.5333*x-1.5333   0.4667*x.^3+2.8668*x.^2+4.3335*x+2.9334

